SELECT
  item_003,
  CASE
    WHEN item_001_tenki = '0' THEN ''
    ELSE item_001_tenki
  END AS item_001_tenki,
  company_name,
  -- 顧客名 カナ（半角カナを全角カナへ変換する）
  arrayFold(
    (acc, t) -> replaceAll(acc, t.1, t.2),

    [
      -- 濁音（最優先）
      ('ｶﾞ','ガ'),('ｷﾞ','ギ'),('ｸﾞ','グ'),('ｹﾞ','ゲ'),('ｺﾞ','ゴ'),
      ('ｻﾞ','ザ'),('ｼﾞ','ジ'),('ｽﾞ','ズ'),('ｾﾞ','ゼ'),('ｿﾞ','ゾ'),
      ('ﾀﾞ','ダ'),('ﾁﾞ','ヂ'),('ﾂﾞ','ヅ'),('ﾃﾞ','デ'),('ﾄﾞ','ド'),

      -- 半濁音
      ('ﾊﾞ','バ'),('ﾋﾞ','ビ'),('ﾌﾞ','ブ'),('ﾍﾞ','ベ'),('ﾎﾞ','ボ'),
      ('ﾊﾟ','パ'),('ﾋﾟ','ピ'),('ﾌﾟ','プ'),('ﾍﾟ','ペ'),('ﾎﾟ','ポ'),

      -- 小文字
      ('ｬ','ャ'),('ｭ','ュ'),('ｮ','ョ'),('ｯ','ッ'),
      ('ｧ','ァ'),('ｨ','ィ'),('ｩ','ゥ'),('ｪ','ェ'),('ｫ','ォ'),

      -- 基本カナ
      ('ｱ','ア'),('ｲ','イ'),('ｳ','ウ'),('ｴ','エ'),('ｵ','オ'),
      ('ｶ','カ'),('ｷ','キ'),('ｸ','ク'),('ｹ','ケ'),('ｺ','コ'),
      ('ｻ','サ'),('ｼ','シ'),('ｽ','ス'),('ｾ','セ'),('ｿ','ソ'),
      ('ﾀ','タ'),('ﾁ','チ'),('ﾂ','ツ'),('ﾃ','テ'),('ﾄ','ト'),
      ('ﾅ','ナ'),('ﾆ','ニ'),('ﾇ','ヌ'),('ﾈ','ネ'),('ﾉ','ノ'),
      ('ﾊ','ハ'),('ﾋ','ヒ'),('ﾌ','フ'),('ﾍ','ヘ'),('ﾎ','ホ'),
      ('ﾏ','マ'),('ﾐ','ミ'),('ﾑ','ム'),('ﾒ','メ'),('ﾓ','モ'),
      ('ﾔ','ヤ'),('ﾕ','ユ'),('ﾖ','ヨ'),
      ('ﾗ','ラ'),('ﾘ','リ'),('ﾙ','ル'),('ﾚ','レ'),('ﾛ','ロ'),
      ('ﾜ','ワ'),('ｦ','ヲ'),('ﾝ','ン')
    ],
    item_224
  ) AS item_224,

  -- 郵便番号(3,4文字目の間にハイフン追加、""は空文字のまま、" "は""へ変換) 
  if(
    item_004 = '',
    '',
    if(
      item_004 = ' ',
      '',
      concat(substr(item_004, 1, 3), '-', substr(item_004, 4, 4))
    )
  ) AS item_004,
  item_005,
  -- TEL(" "なら""に変換、文字列が入っていれば含まれる'-'を削除する)
  if(
    phone_no = ' ',
    '',
    replaceAll(phone_no, '-', '')
  ) AS phone_no,
  -- 携帯電話番号(" "なら""に変換、文字列が入っていれば含まれる'-'を削除する
  if(
    item_007 = ' ',
    '',
    replaceAll(item_007, '-', '')
  ) AS item_007,
  'initial_role' as role_id,
  /* item_024 */
  transform(
    ifNull(toString(item_024), ''),
    ['1','2','3'],
    ['関東','関西','名古屋'],
    ''
  ) AS item_024,
  /* item_230 */
  transform(
    ifNull(toString(item_230), ''),
    ['1','2','3'],
    ['無','有','転居（住所不明）'],
    ''
  ) AS item_230,
  ifNull(
    formatDateTime(
      parseDateTimeBestEffortOrNull(item_026),
      '%Y/%m/%d'
    ),
    ''
  ) AS item_026,
  /* item_030 */
  transform(
    ifNull(toString(item_030), ''),
    [
      '1','2','3','4','5',
      '6','7','8','9','10',
      '11','12','13','14',
      '15','16','17','18',
      '19','20',
      '21','22',
      '23','24','25',
      '26','27','28','29','30','31'
    ],
    [
      'A011 当社客紹介','J040 個人開拓','A031 特約店紹介','B010 寺院紹介','B020 檀家紹介',
      'A041 一般紹介対象','A042 一般紹介','A021 取引先紹介','A012 社友','A013 会友',
      'A052 社員紹介','A053 大野屋グループOB','A061 紹介その他対象','A062 紹介その他',
      'C010 葬儀社','C099 同業者その他','C020 石材店','C030 仏具店',
      'A071 葬儀葬祭部門紹介','A072 仏壇仏具部門紹介',
      'D010 互助会','D099 互助会その他',
      'E010 職域団体','E020 病院','E099 職域団体その他',
      'F010 立川髙島屋','F020 西友','F030 船橋東武','F040 東武外商部','F050 東武ギフトサロン','F099 デパートその他'
    ],
    ''
  ) AS item_030,
  /* item_031 */
  transform(
    ifNull(toString(item_031), ''),
    arrayMap(x -> toString(x), range(1, 78)),
    [
      'G010 TV','G020 ラジオ','G091 インターネット情報','G092 NTTドコモ',
      'G03A 朝日新聞','G03B 毎日新聞','G03C 産経新聞','G03D 日経新聞','G03E 読売新聞',
      'G03F 神戸新聞','G03G 京都新聞','G03H 中日新聞','G03I 東京新聞',
      'G03J はいからエスト','G03K 定年時代','G03L タウン誌その他',
      'G030 新聞','G037 インターカラー','G038 自治体おくやみハンドブック','G039 新聞その他',
      'G040 ちらし','G060 電話帳広告','G031 タウン紙',
      'G081 雑誌','G082 郵便局現金封筒','G083 はいから',
      'I011 ポスティング（投げ込み）','I012 ポスティング（外部委託分）',
      'H010 西武　交通','H020 小田急　交通','H030 京王　交通','H040 東武　交通','H050 地下鉄　交通','H099 交通その他',
      'G050 看板','I010 一般Dメール','G080 通販',
      'J020 テレホンアポイント','I020 買取','I021 ベルシステム24','I022 オートコール',
      'G070 公営霊園イベント','G090 広報企画情報','G099 報道その他',
      'G061 FAX情報BOX','G062 情報案内ダイヤル',
      'J010 ひろい','J030 割当・当番',
      'J050 ギャラリー千葉来店客','J051 ギャラリー横浜来店客','J052 都心営来店客','J053 福生展示場来店客',
      'J054 千葉工事課来店客','J055 町田営業所来店客','J056 北関東支店来店客','J057 仏具北浦和来店客',
      'J058 西関東支店来店客ギャラリーさぎ沼来店客','J059 来店客（関東地区）',
      'J060 西関東支店　来店客','J061 多摩店来店客','J062 小平店来店客','J063 八王子営業所来店客',
      'J070 綾瀬来店客','J080 千葉平和公園店来店客',
      'G034 広報こうべ','G035 中日ショッパー','G036 広報名古屋',
      'G100 セミナー・相談会（お墓関連）','G101 セミナー・相談会（葬儀関連）','G102 セミナー・相談会（名古屋）',
      'I023 名簿','0159 オートテレコール','I110 ESM未入力','J099 紹介媒体その他（不明）',
      'G032 リビング','G033 読売ファミリー','P010 メモリアルパートナー'
    ],
    ''
  ) AS item_031,
  /* item_034 */
  transform(
    ifNull(toString(item_034), ''),
    ['1','2','3','4','5','6','7','8','9'],
    ['6ヶ月以内','6ヶ月以上','初期登録','不明','予備','即案内','名簿','没','失注'],
    ''
  ) AS item_034,
  item_040,
  /* item_035 */
  transform(ifNull(toString(item_035), ''), ['1','2'], ['無','有'], '') AS item_035,
  /* item_036 */
  transform(ifNull(toString(item_036), ''), ['1','2'], ['非対象','対象'], '') AS item_036,
  /* item_225 */
  transform(ifNull(toString(item_225), ''), ['1','2','3'], ['男性','女性','企業法人'], '') AS item_225,

/* item_226 */
transform(
  ifNull(toString(item_226), ''),
  [
    '1','2','3','4','5','6','7','8','9','10',
    '11','12','13','14','15','16','17','18','19'
  ],
  [
    '無宗派',
    '神道',
    'キリスト教',
    '天台宗',
    '真言宗',
    '浄土宗',
    '浄土真宗',
    '浄土真宗本願寺（西本願寺）',
    '真宗大谷派（東本願寺）',
    '臨済宗',
    '曹洞宗',
    '日蓮宗',
    '日蓮正宗',
    '創価学会',
    '立正佼正会',
    '時宗',
    '黄檗宗',
    '禅宗',
    'その他'
  ],
  ''
) AS item_226,
  /* item_029 */
  transform(ifNull(toString(item_029), ''), ['1','2','3','4','5'], ['寿陵','死亡','改葬','建替','不明'], '') AS item_029,
  item_010,
  ifNull(
    formatDateTime(
      parseDateTimeBestEffortOrNull(item_227),
      '%Y/%m/%d'
    ),
    ''
  ) AS item_227,
  item_231,
  -- 送付先　フリガナ（半角カナを全角カナへ変換する）
  arrayFold(
    (acc, t) -> replaceAll(acc, t.1, t.2),

    [
      -- 濁音（最優先）
      ('ｶﾞ','ガ'),('ｷﾞ','ギ'),('ｸﾞ','グ'),('ｹﾞ','ゲ'),('ｺﾞ','ゴ'),
      ('ｻﾞ','ザ'),('ｼﾞ','ジ'),('ｽﾞ','ズ'),('ｾﾞ','ゼ'),('ｿﾞ','ゾ'),
      ('ﾀﾞ','ダ'),('ﾁﾞ','ヂ'),('ﾂﾞ','ヅ'),('ﾃﾞ','デ'),('ﾄﾞ','ド'),

      -- 半濁音
      ('ﾊﾞ','バ'),('ﾋﾞ','ビ'),('ﾌﾞ','ブ'),('ﾍﾞ','ベ'),('ﾎﾞ','ボ'),
      ('ﾊﾟ','パ'),('ﾋﾟ','ピ'),('ﾌﾟ','プ'),('ﾍﾟ','ペ'),('ﾎﾟ','ポ'),

      -- 小文字
      ('ｬ','ャ'),('ｭ','ュ'),('ｮ','ョ'),('ｯ','ッ'),
      ('ｧ','ァ'),('ｨ','ィ'),('ｩ','ゥ'),('ｪ','ェ'),('ｫ','ォ'),

      -- 基本カナ
      ('ｱ','ア'),('ｲ','イ'),('ｳ','ウ'),('ｴ','エ'),('ｵ','オ'),
      ('ｶ','カ'),('ｷ','キ'),('ｸ','ク'),('ｹ','ケ'),('ｺ','コ'),
      ('ｻ','サ'),('ｼ','シ'),('ｽ','ス'),('ｾ','セ'),('ｿ','ソ'),
      ('ﾀ','タ'),('ﾁ','チ'),('ﾂ','ツ'),('ﾃ','テ'),('ﾄ','ト'),
      ('ﾅ','ナ'),('ﾆ','ニ'),('ﾇ','ヌ'),('ﾈ','ネ'),('ﾉ','ノ'),
      ('ﾊ','ハ'),('ﾋ','ヒ'),('ﾌ','フ'),('ﾍ','ヘ'),('ﾎ','ホ'),
      ('ﾏ','マ'),('ﾐ','ミ'),('ﾑ','ム'),('ﾒ','メ'),('ﾓ','モ'),
      ('ﾔ','ヤ'),('ﾕ','ユ'),('ﾖ','ヨ'),
      ('ﾗ','ラ'),('ﾘ','リ'),('ﾙ','ル'),('ﾚ','レ'),('ﾛ','ロ'),
      ('ﾜ','ワ'),('ｦ','ヲ'),('ﾝ','ン')
    ],
    item_232
  ) AS item_232,
  
  -- 送付先 郵便番号(3,4文字目の間にハイフン追加、""は空文字のまま、" "は""へ変換) 
  if(
    item_233 = '',
    '',
    if(
      item_233 = ' ',
      '',
      concat(substr(item_233, 1, 3), '-', substr(item_233, 4, 4))
    )
  ) AS item_233,
  item_234,
  item_235,
  item_012,
  item_013,
  item_014,
  item_015,
  item_016,
  item_017,
  item_018,
  transform(ifNull(toString(item_039), ''), ['1'], ['希望者'], '') AS item_039,
  transform(ifNull(toString(item_037), ''), ['1','2'], ['無','有'], '') AS item_037,
  transform(ifNull(toString(item_038), ''), ['1','2'], ['無','有'], '') AS item_038,
  transform(ifNull(toString(item_025), ''), ['1','2','3'], ['見込客','申込客','決定客'], '') AS item_025,
  transform(ifNull(toString(item_237), ''), ['1','2','3'], ['未確認','同意する','同意しない'], '') AS item_237,
  ifNull(
    formatDateTime(
      parseDateTimeBestEffortOrNull(item_238),
      '%Y/%m/%d'
    ),
    ''
  ) AS item_238,
  item_239, 
  transform(ifNull(toString(item_009), ''), ['1','2','3'], ['不可','可','転居'], '') AS item_009,
  transform(ifNull(toString(item_236), ''), ['1','2','3'], ['不可','可','転居'], '') AS item_236,
  transform(ifNull(toString(item_011), ''), ['1','2','3'], ['送信可','送信不可','未確認'], '') AS item_011,
  transform(ifNull(toString(item_042), ''), ['1','2'], ['活動中','失注'], '') AS item_042
FROM
  {selected_table}